Replace gravizo with mermaid in README
